/*********************************************************
 * ファイル名 : Course.h
 * 責務       : コースの状態を確認する
 * 作成日     : 2020.03.03
 * 作成者     : System-san
 *********************************************************/
#ifndef COURSE_H
#define COURSE_H

/*********************************************************
 * 型
 *********************************************************/
/* コースとのズレ */
typedef enum{
  eNoDiff,      /* ズレていない */
  eDiffLeft,    /* 左にズレている */
  eDiffRight    /* 右にズレている */
} diffCourse_t;

/*********************************************************
 * extern関数宣言
 *********************************************************/
extern void cs_init(void);
extern void cs_term(void);
extern diffCourse_t cs_detectDifference(void);

#endif /* COURSE_H */
