/*********************************************************
 * ファイル名 : Road.h
 * 責務       : 路面の色を確定する
 * 作成日     : 2020.03.03
 * 作成者     : System-san
 *********************************************************/
#ifndef ROAD_H
#define ROAD_H

/*********************************************************
 * 型
 *********************************************************/
/* 路面の色 */
typedef enum {
  eWhite,   /* 白 */
  eLightGray, /* 明るい灰色 */
  eGray,      /* 灰色 */
  eDarkGray,  /* 暗い灰色 */
  eBlack      /* 黒 */
} roadColor_t;

/*********************************************************
 * extern関数宣言
 *********************************************************/
extern void rd_init(void);
extern void rd_term(void);
extern roadColor_t rd_getRoadColor(void);

#endif /* ROAD_H */
