/*********************************************************
 * ファイル名 : Marker.h [mk]
 * 責務       : 道路のマーカーを判断する
 * 作成日     : 2020.03.05
 * 作成者     : System-san
 *********************************************************/
#ifndef MARKER_H
#define MARKER_H

/*********************************************************
 * 型
 *********************************************************/
/* 現在スポットの定義 */
typedef enum {
  eSpotRoad,    /* 道 */
  eSpotShop,    /* 店 */
  eSpotHome     /* 家 */
} Spot_t;

/*********************************************************
 * extern関数宣言
 *********************************************************/
extern void mk_init(void);
extern void mk_term(void);
extern Spot_t mk_presentSpot();

#endif /* MARKER_H */
