/*********************************************************
 * ファイル名 : MARKER.c [mk]
 * 責務       : 道路のマーカーをお店と判断する
 * 作成日     : 2020.03.05
 * 作成者     : System-san
 *********************************************************/
/*** 利用ファイルのヘッダ ***/
#include "../InputCtrl/Road.h"
/*** 自ファイルのヘッダ ***/
#include "MARKER.h"

/*********************************************************
 * 定数
 *********************************************************/
#define NUM_OF_SHOPS (3) /* コース上のお店の数 */
#define SHOP_MARKER (3)  /* お店と判断する白の回数 */

/*********************************************************
 * 変数
 *********************************************************/
static unsigned int shop_number; /* 現在のお店番号 */
static unsigned int mark_counter; /* お店マーカの白の回数 */_

/*** 公開関数 ********************************************/
/*********************************************************
 * 関数名 : mk_init
 * 機能   : 初期化処理
 * 引数   : なし
 * 戻値   : なし
 * 備考   :
 *********************************************************/
void mk_init(void){
  shop_number = 0;
  mark_counter = 0;
  return;
}

/**********************************************************
 * 関数名 : mk_term
 * 機能   : 終了処理
 * 引数   : なし
 * 戻値   : なし
 * 備考   :
 *********************************************************/
void mk_term(void){
  return;
}

/*********************************************************
 * 関数名 : presentSpot
 * 機能   : 現在位置(スポット)を返す
 * 引数   : なし
 * 戻値   : Spot_t spot; 現在のスポット
 * 備考   : なし
 *********************************************************/
Spot_t mk_presentSpot(){
  roadColor_t color;  /* コースの色 */
  Spot_t spot = eSpotRoad;

  /* 道の色を取得 */
  color = rd_getRoadColor();

  if(color == eWhite){
    ++mark_counter;
    if(mark_counter > SHOP_MARKER){
      /* お店もしくは家に到着 */
      if(shop_number < NUM_OF_SHOPS){
        /* お店に到着 */
        spot = eSpotShop;
        shop_number++;
      }else{
        /* 家に到着 */
        spot = eSpotHome;
        shop_number = 0;
      }
      mark_counter = 0;
    }
  }else{
    mark_counter = 0;
  }
  return spot;
}
