/*********************************************************
 * ファイル名 : Shopping.c [sh]
 * 責務       : 買い物をする(一定時間待ち)
 * 作成日     : 2020.03.06
 * 作成者     : System-san
 *********************************************************/
/*** 利用ファイルのヘッダ ***/

/*** 自ファイルのヘッダ ***/
#include "Shopping.h"

/*********************************************************
 * 定数
 *********************************************************/
#define SHOPPING_TIME (5000/20) /* 5秒 (20msec周期で) */

/*********************************************************
 * 変数
 *********************************************************/
static unsigned int remain_time; /* 買い物の残り時間 */

/*** 公開関数 ********************************************/
/**********************************************************
 * 関数名 : sh_init
 * 機能   : 初期化処理
 * 引数   : なし
 * 戻値   : なし
 * 備考   :
 *********************************************************/
void sh_init(void){
  remain_time = 0;
  return;
}

/**********************************************************
 * 関数名   : sh_term
 * 機能     : 終了処理
 * 引数     : なし
 * 戻値     : なし
 * 備考     :
 *********************************************************/
void sh_term(void){
  return;
}

/*********************************************************
 * 関数名   : sh_entryShopping
 * 機能     : 買い物を開始する
 * 引数     : なし
 * 戻値     : なし
 * 備考     : 買い物時間のタイマー設定
 *********************************************************/
void sh_entryShopping(void){
  remain_time = SHOPPING_TIME;
  return;
}

/*********************************************************
 * 関数名   : sh_doneShopping
 * 機能     : 買物が完了したか
 * 引数     : なし
 * 戻値     : boot_t 買物完了
 * 備考     :
 *********************************************************/
bool_t sh_doneShopping(void){
  bool_t done;  /* 買物時間が経過したらTRUE */

  remain_time--;
  if(remain_time <= 0){
    done = eTRUE;
  }else{
    done = eFALSE;
  }

  return done;
}
